'''
寒假作业:
现在小学的数学题目也不是那么好玩的。
看看这个寒假作业：
   □ + □ = □
   □ - □ = □
   □ × □ = □
   □ ÷ □ = □
   
每个方块代表1~13中的某一个数字，但不能重复。
比如：
 6  + 7 = 13
 9  - 8 = 1
 3  * 4 = 12
 10 / 2 = 5

以及：
 7  + 6 = 13
 9  - 8 = 1
 3  * 4 = 12
 10 / 2 = 5

就算两种解法。（加法，乘法交换律后算不同的方案）
 
你一共找到了多少种方案？
'''
plus = [[1, 2, 3], [1, 3, 4], [1, 4, 5], [1, 5, 6], [1, 6, 7], [1, 7, 8], [1, 8, 9], [1, 9, 10], [1, 10, 11], [1, 11, 12], [1, 12, 13], [2, 3, 5], [2, 4, 6], [2, 5, 7], [2, 6, 8], [2, 7, 9], [2, 8, 10], [2, 9, 11], [2, 10, 12], [2, 11, 13], [3, 4, 7], [3, 5, 8], [3, 6, 9], [3, 7, 10], [3, 8, 11], [3, 9, 12], [3, 10, 13], [4, 5, 9], [4, 6, 10], [4, 7, 11], [4, 8, 12], [4, 9, 13], [5, 6, 11], [5, 7, 12], [5, 8, 13], [6, 7, 13]]
'''
for i in range(1,14):
    for j in range(i+1,14):
        if(i+j<=13):
            plus.append([i,j,i+j])
# print(plus)
'''

minus = [[3, 2, 1], [4, 3, 1], [5, 3, 2], [5, 4, 1], [6, 4, 2], [6, 5, 1], [7, 4, 3], [7, 5, 2], [7, 6, 1], [8, 5, 3], [8, 6, 2], [8, 7, 1], [9, 5, 4], [9, 6, 3], [9, 7, 2], [9, 8, 1], [10, 6, 4], [10, 7, 3], [10, 8, 2], [10, 9, 1], [11, 6, 5], [11, 7, 4], [11, 8, 3], [11, 9, 2], [11, 10, 1], [12, 7, 5], [12, 8, 4], [12, 9, 3], [12, 10, 2], [12, 11, 1], [13, 7, 6], [13, 8, 5], [13, 9, 4], [13, 10, 3], [13, 11, 2], [13, 12, 1]]
'''
for i in range(1,14):
    for j in range(1,i):
        if(i-j>0 and i-j!=i and i-j!=j and i-j<j):
            minus.append([i,j,i-j])
print(minus)
'''

mul = [[2, 3, 6], [2, 4, 8], [2, 5, 10], [2, 6, 12], [3, 4, 12]]
'''
for i in range(1,14):
    for j in range(i+1,14):
        if(i*j<=13 and i*j!=i and i*j!=j):
            mul.append([i,j,i*j])
# print(mul)
'''

div = [[6,3,2],[8,4,2],[10,5,2],[12,6,2],[12,4,3]]

# 加法和减法是一个类别。乘法和除法是一个类别
# 遍历乘法的每一个，看每一个类别可以匹配的加法是什么

result = 0

for ele1 in plus:
   for ele2 in minus:
      if(ele1[0] in ele2 or ele1[1] in ele2 or ele1[2] in ele2):
         continue
      else:
         for ele3 in mul:
            if(ele1[0] in ele3 or ele1[1] in ele3 or ele1[2] in ele3 or ele2[0] in ele3 or ele2[1] in ele3 or ele2[2] in ele3):
               continue
            else:
               for ele4 in div:
                  if(ele1[0] in ele4 or ele1[1] in ele4 or ele1[2] in ele4 or ele2[0] in ele4 or ele2[1] in ele4 or ele2[2] in ele4 or ele3[0] in ele4 or ele3[1] in ele4 or ele3[2] in ele4):
                     continue
                  else:
                     result+=1

print(result)
# 4
# 因为交换律的关系，每一个都有两种可能性
# 所以答案是：2*2*2*2*4 = 64
